
[
  {
    "id": "intel_001",
    "date": "2024-07-20",
    "brand": "NIO",
    "model": "ET9",
    "title": "NIO ET9 final production specs revealed in MIIT filing.",
    "source": "MIIT of China",
    "status": "MIIT Filed",
    "confidence": "A",
    "is_pro": true,
    "content": "The Ministry of Industry and Information Technology (MIIT) of China has officially published the declaration for NIO's upcoming flagship, the ET9. This filing provides the final, verified specifications for the production model ahead of its market launch. Key details confirmed include the exact battery capacity, motor power output for the dual-motor setup, and official curb weight. Our analysis shows a slight increase in battery density compared to earlier prototypes, suggesting a last-minute cell chemistry improvement from CATL. This is the most concrete data available to date and solidifies expectations for the ET9's performance. The full filing includes detailed dimensions, tire specifications, and optional equipment configurations, which are critical for competitive analysis. We have broken down the full specification sheet and compared it against the Mercedes-Maybach EQS SUV and other ultra-luxury competitors."
  },
  {
    "id": "intel_002",
    "date": "2024-07-18",
    "brand": "Xiaomi",
    "model": "SU7 Max",
    "title": "Xiaomi announces OTA update 2.1, enhancing ADAS features.",
    "source": "Xiaomi Auto Press",
    "status": "Official Announcement",
    "confidence": "A",
    "is_pro": false,
    "content": "Xiaomi Auto has officially pushed its latest Over-the-Air (OTA) update, version 2.1, to all SU7 models. The update primarily focuses on enhancing the vehicle's Advanced Driver-Assistance Systems (ADAS). Key improvements include more responsive lane-keeping assist on curved roads and better object detection for cyclists and pedestrians in low-light conditions. The update also includes minor bug fixes for the infotainment system."
  },
  {
    "id": "intel_003",
    "date": "2024-07-15",
    "brand": "Li Auto",
    "model": "L9",
    "title": "Leaked photos show facelifted Li Auto L9 with minor cosmetic changes.",
    "source": "Social Media Leak",
    "status": "Rumor",
    "confidence": "C",
    "is_pro": true,
    "content": "Several photos have surfaced on Chinese social media platform Weibo, allegedly showing a facelifted version of the Li Auto L9. The images reveal minor cosmetic tweaks, including a redesigned front bumper with integrated daytime running lights and a new wheel design. While the source of the leak is unverified, the changes appear consistent with a mid-cycle refresh. We are cross-referencing these images with supplier information to determine their authenticity. If true, this indicates Li Auto is accelerating its product refresh cycle to compete with new market entrants. Pro members have access to our full image analysis and an assessment of the potential impact on L9's sales."
  },
  {
    "id": "intel_004",
    "date": "2024-07-12",
    "brand": "Zeekr",
    "model": "All",
    "title": "Zeekr confirms expansion plans for 5 new European markets in 2025.",
    "source": "Zeekr Europe",
    "status": "Confirmed Plan",
    "confidence": "A",
    "is_pro": false,
    "content": "Zeekr has officially confirmed its expansion roadmap for Europe in 2025. The Geely-owned brand will enter five new markets: Spain, Italy, France, Portugal, and Austria. The company plans to open flagship stores in major cities like Paris and Milan by mid-2025. The initial models offered will be the Zeekr 001 and Zeekr X."
  },
  {
    "id": "intel_005",
    "date": "2024-07-10",
    "brand": "BYD",
    "model": "Seal",
    "title": "BYD to start production of Seal model in new Hungary plant in Q4 2024.",
    "source": "Industry Insider",
    "status": "Unconfirmed",
    "confidence": "B",
    "is_pro": true,
    "content": "According to sources within BYD's European supply chain, the company is targeting Q4 2024 to begin trial production of the BYD Seal at its new manufacturing plant in Szeged, Hungary. This marks a significant step in BYD's localization strategy for the European market. The move is expected to shorten delivery times and reduce logistical costs, potentially allowing for more competitive pricing. Our sources indicate that the initial production will focus on the rear-wheel-drive version of the Seal, with the all-wheel-drive performance model to follow in early 2025. We are actively monitoring hiring and equipment installation at the plant to verify this timeline."
  }
]
